<?php

// Задание 6 - Сортировка массивов
// Возьмите предыдущую матрицу и отсортируйте четные строки по возрастанию, а нечетные по убыванию, и снова выведите массив в удобном формате
// (запрещено использовать встроенные в php функции сортировки *sort|asort|ksort|usort*)
// Пример вывода:
// 4 1 1 1
// 2 3 4 6
// 7 2 2 1
// 0 0 0 7
// 7 5 4 0

$matr=[];
$m=mt_rand(3,10);
$n=mt_rand(3,10);
for ($i=0; $i < $m; $i++) 
{ 
	for ($j=0; $j < $n; $j++) 
	{ 
		$matr[$i][$j]=mt_rand(0,9);
	}
}
for ($i=0; $i < $m; $i++) 
{ 
	for ($j=0; $j < $n; $j++) 
	{ 
		$a=$matr[$i][$j];
		echo "$a  ";
	}
	echo "<br>";
}
echo "<br>";
for ($i=0; $i < $m; $i++) 
{ 
	for ($j=0; $j < $n; $j++) 
	{ 
		if ($i%2==0) 
		{
			for ($k=0; $k < $n; $k++) 
			{ 
				if ($matr[$i][$j]>$matr[$i][$k]) 
				{
					$tmp=$matr[$i][$j];
					$matr[$i][$j]=$matr[$i][$k];
					$matr[$i][$k]=$tmp;
				}
			}
			
		}
		if ($i%2!=0) 
		{
			for ($k=0; $k < $n; $k++) 
			{ 
				if ($matr[$i][$j]<$matr[$i][$k]) 
				{
					$tmp=$matr[$i][$j];
					$matr[$i][$j]=$matr[$i][$k];
					$matr[$i][$k]=$tmp;
				}
			}
		}
	}
}
for ($i=0; $i < $m; $i++) 
{ 
	for ($j=0; $j < $n; $j++) 
	{ 
		$a=$matr[$i][$j];
		echo "$a  ";
	}
	echo "<br>";
}
?>